In [44]:
import pandas as pd

## Q1: Create a Series with indexes = 1, 2, 3 and has three names.

In [45]:
index = [1, 2,3]
names = ['Faris', 'Sarah', 'Ahmed']
series = pd.Series(names, index=index)
series

1    Faris
2    Sarah
3    Ahmed
dtype: object

## Q2: Change indexes to 11, 12, 13.

In [46]:
series.index = [11,12,13]
series

11    Faris
12    Sarah
13    Ahmed
dtype: object

## Q3: Retrieve First and second elements.

In [47]:
series[:2]

11    Faris
12    Sarah
dtype: object

## Q4: Add duplicate elements, then remove the duplication

In [50]:
series1=pd.Series(['faris','Ahmed'])
series=series.append(series1)
series

C:\Users\Faris\AppData\Local\Temp\ipykernel_14344\2880728341.py:2: FutureWarning: The series.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  series=series.append(series1)

0    faris
1    Ahmed
0    faris
1    Ahmed
dtype: object

In [51]:
series=series.drop_duplicates()
series

0    faris
1    Ahmed
dtype: object

## Q5: Create a Students DataFrame has three columns (ID, Name)

In [54]:
data={"id":[11,12,13],
      "Name":["Faris","Mohammed","Saeed"]}
stu=pd.DataFrame(data, columns=["id","Name"])
stu

   id      Name
0  11     Faris
1  12  Mohammed
2  13     Saeed

## Q6: Read educ_figdp_1_Data.csv file

In [57]:
df=pd.read_csv("educ_figdp_1_Data.csv")
df

,TIME,GEO,INDIC_ED,Value,Flag and Footnotes
0,2000,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
1,2001,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
2,2002,European Union (28 countries),Total public expenditure on education as % of ...,5.00,e
3,2003,European Union (28 countries),Total public expenditure on education as % of ...,5.03,e
4,2004,European Union (28 countries),Total public expenditure on education as % of ...,4.95,e
...,...,...,...,...,...
379,2007,Finland,Total public expenditure on education as % of ...,5.90,NaN
380,2008,Finland,Total public expenditure on education as % of ...,6.10,NaN
381,2009,Finland,Total public expenditure on education as % of ...,6.81,NaN
382,2010,Finland,Total public expenditure on education as % of ...,6.85,NaN
383,2011,Finland,Total public expenditure on education as % of ...,6.76,NaN

## Q7: What is the difference between loc and slicing?
- loc use the index labels as references
- slice use the position as references

In [62]:
stu.loc[1:3,:]

   id      Name
1  12  Mohammed
2  13     Saeed

In [64]:
stu.loc[1:3,['id','Name']]

   id      Name
1  12  Mohammed
2  13     Saeed

In [69]:
stu[0:1]

   id   Name
0  11  Faris